In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

### Loading Dataset's

In [2]:
Movies=pd.read_csv('Movies.csv', encoding='latin-1')
Movies.head()

   MovieID                               Title                      Category
0        1                    Toy Story (1995)   Animation|Children's|Comedy
1        2                      Jumanji (1995)  Adventure|Children's|Fantasy
2        3             Grumpier Old Men (1995)                Comedy|Romance
3        4            Waiting to Exhale (1995)                  Comedy|Drama
4        5  Father of the Bride Part II (1995)                        Comedy

In [3]:
Ratings=pd.read_csv('Ratings.csv')
Ratings.head()

   UserID  MovieID  Rating
0       1     1193       5
1       1      661       3
2       1      914       3
3       1     3408       4
4       1     2355       5

In [4]:
Users=pd.read_csv('Users.csv')
Users.head()

   UserID Gender  Age  Occupation
0       1      F    1          10
1       2      M   56          16
2       3      M   25          15
3       4      M   45           7
4       5      M   25          20

Clearly,we can see the mapping among these three Datset by MovieID,UserID Respectively.But,before doing these Mapping on the Datset we need to wrangling the dataset to see any missing values in them.

### Data Cleaning

In [5]:
Movies.isna().sum()

MovieID     0
Title       0
Category    0
dtype: int64

In [6]:
Ratings.isna().sum()

UserID     0
MovieID    0
Rating     0
dtype: int64

In [7]:
Users.isna().sum()

UserID        0
Gender        0
Age           0
Occupation    0
dtype: int64

The all three Datset looks fine.Let's do the mapping of these data set so that we can corelate the data entries easily

### Dataset Mapping

The Category Column of the Movies.csv dataset having values in Pipe seperated ('|') values in series.we need to first remove this pipe seperation and align them in proper list order.

In [8]:
Movies['Category']=Movies['Category'].apply(lambda x: str(x.replace('|', ',')))
Movies

,MovieID,Title,Category
0,1,Toy Story (1995),"Animation,Children's,Comedy"
1,2,Jumanji (1995),"Adventure,Children's,Fantasy"
2,3,Grumpier Old Men (1995),"Comedy,Romance"
3,4,Waiting to Exhale (1995),"Comedy,Drama"
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
3878,3948,Meet the Parents (2000),Comedy
3879,3949,Requiem for a Dream (2000),Drama
3880,3950,Tigerland (2000),Drama
3881,3951,Two Family House (2000),Drama
3882,3952,"Contender, The (2000)","Drama,Thriller"

In [9]:
Movies['Category']=Movies.Category.str.split(',')
Movies

,MovieID,Title,Category
0,1,Toy Story (1995),"[Animation, Children's, Comedy]"
1,2,Jumanji (1995),"[Adventure, Children's, Fantasy]"
2,3,Grumpier Old Men (1995),"[Comedy, Romance]"
3,4,Waiting to Exhale (1995),"[Comedy, Drama]"
4,5,Father of the Bride Part II (1995),[Comedy]
...,...,...,...
3878,3948,Meet the Parents (2000),[Comedy]
3879,3949,Requiem for a Dream (2000),[Drama]
3880,3950,Tigerland (2000),[Drama]
3881,3951,Two Family House (2000),[Drama]
3882,3952,"Contender, The (2000)","[Drama, Thriller]"

In [10]:
Movies=Movies.explode('Category')
Movies

      MovieID                       Title    Category
0           1            Toy Story (1995)   Animation
0           1            Toy Story (1995)  Children's
0           1            Toy Story (1995)      Comedy
1           2              Jumanji (1995)   Adventure
1           2              Jumanji (1995)  Children's
...       ...                         ...         ...
3879     3949  Requiem for a Dream (2000)       Drama
3880     3950            Tigerland (2000)       Drama
3881     3951     Two Family House (2000)       Drama
3882     3952       Contender, The (2000)       Drama
3882     3952       Contender, The (2000)    Thriller

[6407 rows x 3 columns]

Clearly,we can see No. of Rows of the Movies datset has increased almost by double...Lets check if there's any empty value is there now

In [11]:
Movies.isna().sum()

MovieID     0
Title       0
Category    0
dtype: int64

The Datset looks fine...Let's Proceed

In [12]:
df = pd.merge(Movies, Ratings, on='MovieID',how='outer')
df

         MovieID                  Title   Category  UserID  Rating
0              1       Toy Story (1995)  Animation     1.0     5.0
1              1       Toy Story (1995)  Animation     6.0     4.0
2              1       Toy Story (1995)  Animation     8.0     4.0
3              1       Toy Story (1995)  Animation     9.0     5.0
4              1       Toy Story (1995)  Animation    10.0     5.0
...          ...                    ...        ...     ...     ...
2102013     3952  Contender, The (2000)   Thriller  5812.0     4.0
2102014     3952  Contender, The (2000)   Thriller  5831.0     3.0
2102015     3952  Contender, The (2000)   Thriller  5837.0     4.0
2102016     3952  Contender, The (2000)   Thriller  5927.0     1.0
2102017     3952  Contender, The (2000)   Thriller  5998.0     4.0

[2102018 rows x 5 columns]

In [13]:
df.isna().sum()

MovieID       0
Title         0
Category      0
UserID      216
Rating      216
dtype: int64

Since,we cannot fill na value..It's smart to just cut-off from our dataset

In [14]:
df=df.dropna()

In [15]:
df.isna().sum()

MovieID     0
Title       0
Category    0
UserID      0
Rating      0
dtype: int64

In [16]:
df

         MovieID                  Title   Category  UserID  Rating
0              1       Toy Story (1995)  Animation     1.0     5.0
1              1       Toy Story (1995)  Animation     6.0     4.0
2              1       Toy Story (1995)  Animation     8.0     4.0
3              1       Toy Story (1995)  Animation     9.0     5.0
4              1       Toy Story (1995)  Animation    10.0     5.0
...          ...                    ...        ...     ...     ...
2102013     3952  Contender, The (2000)   Thriller  5812.0     4.0
2102014     3952  Contender, The (2000)   Thriller  5831.0     3.0
2102015     3952  Contender, The (2000)   Thriller  5837.0     4.0
2102016     3952  Contender, The (2000)   Thriller  5927.0     1.0
2102017     3952  Contender, The (2000)   Thriller  5998.0     4.0

[2101802 rows x 5 columns]

In [17]:
df1 = pd.merge(df, Users, on='UserID',how='outer')
df1

,MovieID,Title,Category,UserID,Rating,Gender,Age,Occupation
0,1,Toy Story (1995),Animation,1.0,5.0,F,1,10
1,1,Toy Story (1995),Children's,1.0,5.0,F,1,10
2,1,Toy Story (1995),Comedy,1.0,5.0,F,1,10
3,48,Pocahontas (1995),Animation,1.0,5.0,F,1,10
4,48,Pocahontas (1995),Children's,1.0,5.0,F,1,10
...,...,...,...,...,...,...,...,...
2101797,3536,Keeping the Faith (2000),Romance,5727.0,5.0,M,25,4
2101798,3555,U-571 (2000),Action,5727.0,3.0,M,25,4
2101799,3555,U-571 (2000),Thriller,5727.0,3.0,M,25,4
2101800,3578,Gladiator (2000),Action,5727.0,5.0,M,25,4
2101801,3578,Gladiator (2000),Drama,5727.0,5.0,M,25,4

In [18]:
df1.isna().sum()

MovieID       0
Title         0
Category      0
UserID        0
Rating        0
Gender        0
Age           0
Occupation    0
dtype: int64

We get our desire output now i can apply logic to get my desired output

### Main Operations

This is for tcs 1 assignment 2nd question solution

In [19]:
P=[]
def two(x):
     for i in df1.Category.unique():
            s=df1.loc[(df1['Age']==x) & (df1['Category']==i),['Category','Title','Rating']].mean().round().tolist()
            P.append([i,s])
            dfd=pd.DataFrame(P, columns=['Category','Average_rating'])
     print(dfd)

Description:The upper Define function shows the Average Rating of the Movies Category of different age groups and taking arguement as an Age Group

In [20]:
two(35)

       Category Average_rating
0     Animation          [4.0]
1    Children's          [4.0]
2        Comedy          [4.0]
3       Musical          [4.0]
4       Romance          [4.0]
5         Drama          [4.0]
6        Action          [4.0]
7     Adventure          [4.0]
8       Fantasy          [3.0]
9        Sci-Fi          [4.0]
10          War          [4.0]
11        Crime          [4.0]
12     Thriller          [4.0]
13      Western          [4.0]
14       Horror          [3.0]
15      Mystery          [4.0]
16  Documentary          [4.0]
17    Film-Noir          [4.0]

This is for tcs 1 assignment 3rd question solution

In [21]:
o=[]
def three(x):
     for i in df1.Category.unique():
            s=df1.loc[(df1['Occupation']==x) & (df1['Category']==i),['Category','Title','Rating']].mean().round().tolist()
            o.append([i,s])
            dfo=pd.DataFrame(o, columns=['Category','Average_rating'])
     print(dfo)

Description:This function shows Average Rating of different category movies by taking Occupation in Args

In [22]:
three(12)

       Category Average_rating
0     Animation          [4.0]
1    Children's          [3.0]
2        Comedy          [4.0]
3       Musical          [4.0]
4       Romance          [4.0]
5         Drama          [4.0]
6        Action          [4.0]
7     Adventure          [4.0]
8       Fantasy          [3.0]
9        Sci-Fi          [4.0]
10          War          [4.0]
11        Crime          [4.0]
12     Thriller          [4.0]
13      Western          [4.0]
14       Horror          [3.0]
15      Mystery          [4.0]
16  Documentary          [4.0]
17    Film-Noir          [4.0]

This is for tcs 1 assignment 4 question

In [23]:
f=[]
def four(x):
     for i in df1.Age.unique():
            s=df1.loc[(df1['Category']==x) & (df1['Age']==i),['Occupation']].mode()
            f.append([i,s])
            dff=pd.DataFrame(f, columns=['Age_Group','Occupation'])
     print(dff)

Description:This function shows the Occupation of the user's of all the Age group Based on different Movies Category also it Taking Arguement as a Movies Category.

In [24]:
df1.Category.unique()

array(['Animation', "Children's", 'Comedy', 'Musical', 'Romance', 'Drama',
       'Action', 'Adventure', 'Fantasy', 'Sci-Fi', 'War', 'Crime',
       'Thriller', 'Western', 'Horror', 'Mystery', 'Documentary',
       'Film-Noir'], dtype=object)

In [25]:
four('Horror')

   Age_Group                   Occupation
0          1     Occupation
0          10
1         50     Occupation
0           0
2         25     Occupation
0           0
3         35     Occupation
0           0
4         18     Occupation
0           4
5         45     Occupation
0           7
6         56     Occupation
0          13

The Below code is Atempt to remove prefix Occupation 0 from occupation column of  our function four

In [26]:
# dff=pd.DataFrame(f, columns=['Age_Group','Occupation'])
# dff

In [27]:
# dff.Occupation = dff.Occupation.str.strip('Occupation 0') 
# dff

In [28]:
# dff = dff.Occupation.apply(lambda S:S.str.strip('Occupation 0'))

### Console Based UI

This is the Bunch of all the above function made into Simple Console Based UI.

In [48]:
cont = 'Y'
while(cont == 'Y'):
 print("1 : Category and Age group liking\n2:movie category and occupation of users\n3:most likely age group of users and type of occupations \n0: To Exit\nEnter your Choice::");
 data =  int(input())
 if(data == 1):
    print('Enter the age Group from the given list:\n',df1.Age.unique())
    data1 = int(input())
    two(data1)
 if(data == 2):
     print('Enter the Occupation from the given list:\n',df1.Occupation.unique())
     data2 = int(input())
     three(data2)
 if(data == 3):
     print('Enter the Category from the given list:\n',df1.Category.unique())
     data3 = str(input())
     four(data3)
 if(data == 0):
    cont='N'

1 : Category and Age group liking
2:movie category and occupation of users
3:most likely age group of users and type of occupations
0: To Exit
Enter your Choice::
0

### END